{
  "tag": "2020-02-22_000934-157",
  "event": {
    "executed_times": 0,
    "children_event_ids": [],
    "parent_event_ids": [],
    "weight": 100,
    "last_weight": 0,
    "number_of_unexecuted_children_events": 0,
    "event_type": "touch",
    "x": null,
    "y": null,
    "view": {
      "checkable": false,
      "selected": false,
      "scrollable": false,
      "long_clickable": true,
      "resource_id": "de.rampro.activitydiary.debug:id/policyTextView",
      "visible": true,
      "enabled": true,
      "clickable": true,
      "checked": false,
      "is_password": false,
      "content_description": null,
      "focused": false,
      "class": "android.widget.TextView",
      "children": [],
      "child_count": 0,
      "package": "de.rampro.activitydiary.debug",
      "text": "Privacy Policy\n\nActivityDiary is a free, libre and open source application to track your activities. This privacy policy applies to this Android application and describes what data is stored and processed by the ActivityDiary.\n\nIntroduction\n\nDevelopers of ActivityDiary, we (or “us” or “our”) respect the privacy of our users (“user” or “you”). As the aim of this application is to keep a record of your activites a lot of sensitive personal information is collected and stored. Nevertheless is this your data and you have full control over it. This Privacy Policy explains how the ActivityDiary application (the “Application”) collects, uses, discloses, and safeguards your information. Our names can be extracted from the meta data in the git repositories and within the Application.\n\nPlease read this Privacy Policy carefully. If you do not agree with the terms of this Privacy Policy, please do not access the Application and remove it from your device.\n\nWe reserve the right to make changes to this Privacy Policy at any time and for any reason. We will alert you about any changes by updating the “Last updated” date of this Privacy Policy.\n\nYou are encouraged to periodically review this Privacy Policy to stay informed of updates. You will be deemed to have been made aware of, will be subject to, and will be deemed to have accepted the changes in any revised Privacy Policy by your continued use of the Application after the date such revised Privacy Policy is posted.\n\nThis Privacy Policy does not apply to the third-party online/mobile store from which you install the Applications or make payments, which may also collect and use data about you. We are not responsible for any of the data collected by any such third party.\n\nWhat data is processed and stored?\n\nActivity Data\n\nThe data you enter to record your activities, including the date and time of start and end of the activity, combined with formatting, notes, pictures and relationships between different activites you attach to those activites is stored. Deleting entries like activities or pictures doesn't completely remove them from the database but only hides them.\n\nGeo-Location Information (ACCESS_FINE_LOCATION, GPS)\n\nIf configured the application accesses location-based information from your mobile device to relate acitivites to location and provide activity suggestions based on location information. If you wish to change ActivityDiarys access or permissions, you may do so in your device’s settings or disable the use of location services in the applications settings. Note that this does not influence or remove the already collected location data.\n\nDevice storage (WRITE_EXTERNAL_STORAGE)\n\nStorage and retreival of backups, photos and other files you attach to your activity diary need access to Androids external storage / SD card.\n\nCamera\n\nThe application enables you to take photos with your devices' camera and attach them to your activity diary. This is the only usage of the camera permission.\n\nNetwork state (ACCESS_NETWORK_STATE, ACCESS_WIFI_STATE)\n\nNetwork and WIFI state is stored to correlate activities to those data and to propose and set next activites based on the current state.\n\nCrash Reporting\n\nIn case of a program fault (crash) the application prepares a report that helps us to improve the behavior of the application. This report contains a lot of technical data about your device and operating system, the complete preferences of the application and the trace of program steps that was exectued right before the crash. The hardware of your device including but not limited to screen size and resolution, the manufacturer, the language setting and versions of the operating system and application are identifiable. The prepared report is not transmitted automatically, but shared to your email application in a newly composed email that you - at your own will - can send to us or whomever you want. Protecting the data during transmission by using encrypted email transfer is under responsibility of you and your mail service provider. We highly recommend to thoroughfully review the report and remove all data you don't understand and/or don't want to share.\n\nAs the used media is email you will disclose your name, email address, and several other technical data like IP address and email service provider by transmitting a crash report. We will not use this information for anything else than contacting you about the crash.\n\nAnonymous extracts of the report that do not allow your indentification might be used in the public issue tracker for documenting the crash and tracking the rework.\n\nAdditional to this report prepared by the application your operating system or services on you device might transmit crash or usage reports, but those are not part of ActivityDiary, not covered by this privacy policy and under your own responsibility.\n\nWhy does the application store data?\n\nThe Applications is designed to create a record of your activites. This is achieved by selecting the current activities manually or automatically, based on evaluation of data entered by you or collected by your device. The data you enter into the application is stored for later retreival by the user. The application stores and evaluates data of different sensors of your device to suggest or even automatically select the next activities. No data is collected, transmitted or stored that is not required for its intended functionality.\n\nWhen you use the Application, your personal information is stored and evaluated locally on your device and not transmitted to any organization or company without your explicity request.\n\nThe stored data can be deleted by removing the application and deleting the backups created by you and backup mechanisms of your device.\n\nHow is the data protected?\n\nThe Application store unencrypted data locally on the device it is executed on. You are responsible to protect the stored data from unauthorized access. We highly recommend to protect your device with a strong password and even encrypt your devices' storage. Backups created by the application itself or any device backup mechanism also need to be protected by you in a similar fashion.\n\nSecurity of your information\n\nWe use the mechanisms provided by the Android framework to protect your personal information from other applications on your device. While we have taken reasonable steps to secure the personal information you provide to us, please be aware that despite our efforts, no security measures are perfect or impenetrable, and no method of data protection can be guaranteed against any interception or other type of misuse. Therefore, we cannot guarantee complete security of you provide personal information.\n\nYour rights\n\nAt any time and free of cost you have the right to ask us about which data we store about you. You can always request for correction or removal of personal data or restrict the use of your data.\n\nContact us\n\nRaphael Mack, Joh.-Seb.-Bach-Str. 3, 74321 Bietigheim-Bissingen (Germany)\n\nactivity-diary@rampro.de\n\n",
      "bounds": [
        [
          11,
          32
        ],
        [
          789,
          1205
        ]
      ],
      "editable": false,
      "focusable": true,
      "parent": 6,
      "temp_id": 7,
      "size": "778*1173",
      "sibling_id": 0,
      "is_ignored": false,
      "signature": "[class]android.widget.TextView[resource_id]de.rampro.activitydiary.debug:id/policyTextView[text]None[enabled,,]",
      "view_str": "f4cd948f5d54b7fa2651b6c666850996_0",
      "content_free_signature": "[class]android.widget.TextView[resource_id]de.rampro.activitydiary.debug:id/policyTextView[content_desc]None"
    }
  },
  "start_state": "192952f1c7a29ff91523e56e3258c8b5",
  "stop_state": "192952f1c7a29ff91523e56e3258c8b5",
  "event_str": "TouchEvent(state=192952f1c7a29ff91523e56e3258c8b5, view=f4cd948f5d54b7fa2651b6c666850996_0)",
  "is_inserted_event": false,
  "utg_event_id": 12
}